---
kind: method
id: M:Autodesk.Revit.DB.VertexIndexPairArray.GetEnumerator
source: html/3b17583b-b874-1744-5686-a638d344ec8b.htm
---
# Autodesk.Revit.DB.VertexIndexPairArray.GetEnumerator Method

Retrieve a forward moving iterator to the array.

## Syntax (C#)
```csharp
public virtual IEnumerator GetEnumerator()
```

## Returns
Returns a forward moving iterator to the array.